# В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растет на круглой грядке, причем кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.

# Эти кусты обладают разной урожайностью, поэтому ко времени сбора н
# а них выросло различное число ягод – на i-ом кусте выросло ai ягод.

# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.

# Напишите программу для нахождения максимального числа ягод, 
# которое может собрать за один заход собирающий модуль, находясь перед некоторым 
# кустом заданной во входном файле грядки.

# Входные данные
# Первая строка входного файла INPUT.TXT содержит целое число N (3 ≤ N ≤ 1000) – количество кустов черники. 
# Вторая строка содержит N целых положительных чисел a1, a2, ..., aN – число ягод черники, растущее на соответствующем кусте. 
# Все ai не превосходят 1000.


# Console.Clear();
# Console.Write("Введите максимальное количестов кустов: ");
import random
a = int(input('Введите максимальное количестов кустов: '))
# int n = Convert.ToInt32(Console.ReadLine());
# Console.Write("Введите максимальное количестов ягод на одном кусте: ");
b = int(input('Введите максимальное количестов ягод на одном кусте: '))
# int a = Convert.ToInt32(Console.ReadLine());
# int max = 0;
max = 0
i = 1
# int[] array = new int[n];
kust = [(random.randint(1,b)) for i in range(a)]
# for (int i = 0; i < array.Length; i++)
# {
#     array[i] = new Random().Next(1, a);
# }

# for (int i = 1; i < (array.Length-1); i++)
# {
#     int sum = array[i-1] + array[i] + array[i+1];
#     if (sum > max) max = sum;
# }
print(kust)

while i < len(kust) - 1:
    summ = kust[i-1] + kust[i] + kust[i+1]
    if (summ> max): max = summ
    i += 1
left_edge = kust[len(kust) - 1] + kust[0] + kust[1]
right_edge = kust[len(kust) - 1] + kust[0] + kust[len(kust) - 2]
if left_edge > max: print(f'Максимальное число ягод {left_edge}')
elif right_edge > max: print(f'Максимальное число ягод {right_edge}')
else: print(f'Максимальное число ягод {max}')
print('ТАКАЯ ЗАДАЧА УЖЕ БЫЛА!!!')
# Console.WriteLine($"[{string.Join(", ", array)}]");
# Console.WriteLine($"Максимальное количество ягод равно {max}.");
